#+title: Doom Emacs Config
#+description: My best attempt at building a world for myself.
#+property: header-args:emacs-lisp :tangle config.el :comments 'link'
#+startup: content

** Identity
Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates and snippets. It is optional.

#+begin_src emacs-lisp
(setq user-full-name "Michael Utz"
      user-mail-address "michael@theutz.com")
#+end_src

#+RESULTS:
: michael@theutz.com

** Themes
There are two ways to load a theme. Both assume the theme is installed and available. You can either set `doom-theme' or manually load a theme with the `load-theme' function. This is the default:

#+begin_src emacs-lisp
(setq doom-theme-dark 'doom-rose-pine
      doom-theme-light 'doom-rose-pine-dawn
      doom-theme doom-theme-light)

(defun my/apply-theme (appearance)
  "Load theme, taking current system APPEARANCE into consideration."
  (mapc #'disable-theme custom-enabled-themes)
  (pcase appearance
    ('light (load-theme doom-theme-light t))
    ('dark (load-theme doom-theme-dark t))))

(add-hook 'ns-system-appearance-change-functions #'my/apply-theme)
#+end_src

#+RESULTS:
| my/apply-theme |

*** Line spacing

Some useful tools for toggling line spacing. You can press =SPC t s= to toggle big or small spacing. Additionally, you can configure the amount of spacing that is toggled.

Firstly, I'll setup a user defined variable that I'll use to change the line spacing.

#+begin_src emacs-lisp :results silent
(defvar toggle-line-spacing 0.4
  "Amount of line spacing to use when toggling line spacing")
#+end_src

Next, of course, we setup the actual function that does the toggling.

#+begin_src emacs-lisp :results silent
(defun toggle-line-spacing ()
  "Toggle line spacing between no extra space to a lil extra space"
  (interactive)
  (if line-spacing
      (setq line-spacing nil)
    (setq line-spacing toggle-line-spacing))
  (redraw-frame (selected-frame)))
#+end_src

And what's the point of all this if there's no keymap?

#+begin_src emacs-lisp :results silent
(map! :desc "Line spacing"
      :leader
      :n "ts"
      #'toggle-line-spacing)
#+end_src

Finally, I'll set the default value for line spacing.

#+begin_src emacs-lisp :results silent
(setq line-spacing toggle-line-spacing)
#+end_src

#+RESULTS:
: 0.4

****** User-defined variables

I want nushell to work with org-babel, but nobody's done the dirty work yet. We'll start with the basics. We might want this command to be customizable for someone's environment.

- ~org-babel-nushell-command~

  #+name: define-org-babel-nushell-command
  #+begin_src emacs-lisp :session org-babel-nushell :results silent
  (defvar org-babel-nushell-command
    "nu"
    "The command to execute babel body code.")
  #+end_src

  #+name: org-babel-nushell-command
  #+begin_src emacs-lisp :tangle no
  org-babel-nushell-command
  #+end_src

  #+RESULTS: org-babel-nushell-command
  : nu

Additionally, since I can't be certain the specific environment emacs will be running this command in, I need to be able to pass in the nushell config files so things operate as expected in my environment.

First I'll setup a variable for the root directory where the config files live. While nushell currently defaults to the Apple-specifc XDG paths (like in =~/Library=), I don't like that. So I'll use the arch-based defaults.

- ~org-babel-nushell-config-dir~

  #+name: define-org-babel-nushell-config-dir
  #+begin_src emacs-lisp :session org-babel-nushell :results silent
  (defvar org-babel-nushell-config-dir
    (concat (file-name-as-directory (or (getenv "XDG_CONFIG_HOME")
                                        (getenv "HOME" ".config")))
            "nushell/")
    "Absolute path to the root directory where config files for nushell exist.")
  #+end_src

Then I'll create two variables for the actual config files required for successful nushell startup.

#+name: org-babel-define-config-env-file
#+begin_src emacs-lisp :session org-babel-nushell :results silent
(defvar org-babel-nushell-env-config-file
  (concat org-babel-nushell-config-dir "env.nu")
  "Absolute path to the nu file used to configure a non-interactive nushell session.")
#+end_src

#+name: org-babel-config-file
#+begin_src emacs-lisp :tangle no :session org-babel-nushell
org-babel-nushell-config-file
#+end_src

#+RESULTS: org-babel-config-file
: /Users/michael/.config/nushell/config.nu

#+name: org-babel-define-config-file
#+begin_src emacs-lisp :session org-babel-nushell :results silent
(defvar org-babel-nushell-config-file
  (concat org-babel-nushell-config-dir "config.nu")
  "Absolute path to the nu file used to configure an interactive nushell session.")
#+end_src

#+name: org-babel-env-file
#+begin_src emacs-lisp :tangle no :session org-babel-nushell
org-babel-nushell-env-config-file
#+end_src

#+RESULTS: org-babel-env-file
: /Users/michael/.config/nushell/env.nu

Lastly, I'll join them all together in a string with the ~--login~ flag.

#+name: define-org-babel-nushell-command-options
#+begin_src emacs-lisp :session org-babel-nushell :results silent
(defvar org-babel-nushell-command-options
  (mapconcat 'identity (list "--no-newline"
                             "--env-config"
                             org-babel-nushell-env-config-file
                             "--config"
                             org-babel-nushell-config-file)
             " ")
  "The command options to use when executing code")
#+end_src

Altogether, that should produce the following:

#+name: check-org-babel-nushell-command-options
#+begin_src emacs-lisp :session org-babel-nushell :tangle no
org-babel-nushell-command-options
#+end_src

#+RESULTS: check-org-babel-nushell-command-options
: --login --env-config /Users/michael/.config/nushell/env.nu --config /Users/michael/.config/nushell/config.nu

******** Concatenating with body

#+begin_src emacs-lisp :results silent :session org-babel-nushell-parsing-variables
(defun org-babel-nushell-custom-vars (params body)
  "Append custom variables at top."
  (if (= (length params) 0)
      body
    (concat (mapconcat 'org-babel-nushell-var-to-nushell params "\n") "\n" body)))
#+end_src

#+begin_src emacs-lisp :session org-babel-nushell-parsing-variables :tangle no
(org-babel-nushell-custom-vars '(("one" . "a\n") ("two" . "b")) "my body")
#+end_src

#+RESULTS:
: let "one" = "a"
: let "two" = "b"
: my body

******** Parsing individual parameters

#+begin_src emacs-lisp :results silent :session org-babel-nushell-parsing-variables
(defun org-babel-nushell-var-to-nushell (pair)
  "Convert an elisp var into a string of go source code
specifying a var of the same value."
  (let* ((var (car pair))
         (val (cdr pair)))
    (when (symbolp val)
      (setq val (symbol-name val)))
    (while (string-match-p "\n\\'" val)
      (setq val (substring val 0 -1)))
    (format "let %S = %S" var val)))
#+end_src

#+begin_src emacs-lisp :session org-babel-nushell-parsing-variables :tangle no
(org-babel-nushell-var-to-nushell '("my_var" . "my value"))
#+end_src

#+RESULTS:
: let "my_var" = "my value"

******* Ensuring it works

Here's a code block that we can run as a sanity check to make sure this is all working.

#+begin_src nushell :dir ~ :var str="hello" :tangle no
$str | split chars
#+end_src

#+RESULTS:
: ╭───┬───╮
: │ 0 │ h │
: │ 1 │ e │
: │ 2 │ l │
: │ 3 │ l │
: │ 4 │ o │
: ╰───┴───╯

*** Org

Some variables need to be set before org loads.

#+begin_src emacs-lisp
(setq org-directory "~/Dropbox/org/")
#+end_src

#+RESULTS:
: ~/Dropbox/org/

But some can run after org loads

#+begin_src emacs-lisp :results silent
(after! org
  (add-to-list 'org-modules 'org-habit)
  (setq org-todo-keywords
        '((sequence
           "TODO(t)"             ; A task that needs doing & is ready to do
           "PROJ(p)"             ; A project, which usually contains other tasks
           "LOOP(r)"             ; A recurring task
           "STRT(s)"             ; A task that is in progress
           "WAIT(w)"             ; Something external is holding up this task
           "HOLD(h)"             ; This task is paused/on hold because of me
           "IDEA(i)"             ; An unconfirmed and unapproved task or notion
           "|"
           "DONE(d)"   ; Task successfully completed
           "KILL(k)")  ; Task was cancelled, aborted, or is no longer applicable
          (sequence
           "[ ](T)"                     ; A task that needs doing
           "[-](S)"                     ; Task is in progress
           "[?](W)"                     ; Task is being held up or paused
           "|"
           "[X](D)")                    ; Task was completed
          (sequence
           "|"
           "OKAY(o)"
           "YES(y)"
           "NO(n)"))
        org-todo-keyword-faces
        '(("[-]"  . +org-todo-active)
          ("STRT" . +org-todo-active)
          ("[?]"  . +org-todo-onhold)
          ("WAIT" . +org-todo-onhold)
          ("HOLD" . +org-todo-onhold)
          ("PROJ" . +org-todo-project)
          ("NO"   . +org-todo-cancel)
          ("KILL" . +org-todo-cancel)))
  (map! :localleader
        :mode org-mode
        :desc "org-columns"
        :n "m"
        #'org-columns)
  (map! :localleader
        :mode org-mode
        :desc "org-refile-copy"
        :n "rd"
        #'org-refile-copy)
  (map! :localleader
        :mode org-mode
        :desc "org-delete-property"
        :n "O"
        #'org-delete-property))
#+end_src

